app/controllers/messages_controller.rb

  def create
    recipients = User.where(id: params['recipients'])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]